Ran Plan for dir: `terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
aws_s3_bucket.s3_home: Refreshing state... [id=terraform-20220121192859548500000001]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.s3_home has changed
~ resource "aws_s3_bucket" "s3_home" {
        id                          = "terraform-20220121192859548500000001"
      + tags                        = {}
        # (12 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.github-actions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "github-actions"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::terraform-20220121192859548500000001",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_iam_access_key.github-actions will be created
+ resource "aws_iam_access_key" "github-actions" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "github-actions"
    }

  # aws_iam_user.github-actions will be created
+ resource "aws_iam_user" "github-actions" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "github-actions"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_s3_bucket_policy.github-actions will be created
+ resource "aws_s3_bucket_policy" "github-actions" {
      + bucket = "terraform-20220121192859548500000001"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # github_actions_organization_secret.AWS_ACCESS_KEY_ID will be created
+ resource "github_actions_organization_secret" "AWS_ACCESS_KEY_ID" {
      + created_at              = (known after apply)
      + id                      = (known after apply)
      + plaintext_value         = (sensitive value)
      + secret_name             = "AWS_ACCESS_KEY_ID"
      + selected_repository_ids = [
          + 450579704,
        ]
      + updated_at              = (known after apply)
      + visibility              = "selected"
    }

  # github_actions_organization_secret.AWS_REGION will be created
+ resource "github_actions_organization_secret" "AWS_REGION" {
      + created_at              = (known after apply)
      + id                      = (known after apply)
      + plaintext_value         = (sensitive value)
      + secret_name             = "AWS_REGION"
      + selected_repository_ids = [
          + 450579704,
        ]
      + updated_at              = (known after apply)
      + visibility              = "selected"
    }

  # github_actions_organization_secret.AWS_SECRET_ACCESS_KEY will be created
+ resource "github_actions_organization_secret" "AWS_SECRET_ACCESS_KEY" {
      + created_at              = (known after apply)
      + id                      = (known after apply)
      + plaintext_value         = (sensitive value)
      + secret_name             = "AWS_SECRET_ACCESS_KEY"
      + selected_repository_ids = [
          + 450579704,
        ]
      + updated_at              = (known after apply)
      + visibility              = "selected"
    }

Plan: 6 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.greenatlantis.ga/lock?id=marknooch%252Ffoodtrucks%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 6 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
